SoCXin/N32G430/src/projects/n32g430_EVAL/examples/USART/HardwareFlowCtrl/inc/main.h
/*****************************************************************************
 * Copyright (c) 2019, Nations Technologies Inc.
 *
 * All rights reserved.
 * ****************************************************************************
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * - Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the disclaimer below.
 *
 * Nations' name may not be used to endorse or promote products derived from
 * this software without specific prior written permission.
 *
 * DISCLAIMER: THIS SOFTWARE IS PROVIDED BY NATIONS "AS IS" AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * DISCLAIMED. IN NO EVENT SHALL NATIONS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * ****************************************************************************/
 
/**
*\*\file main.h
*\*\author Nations
*\*\version v1.0.0
*\*\copyright Copyright (c) 2019, Nations Technologies Inc. All rights reserved.
**/
#ifndef __MAIN_H__
#define __MAIN_H__

#ifdef __cplusplus
extern "C" {
#endif

#include "n32g430.h"

#define _USART1_USART2_

#ifdef _USART1_USART2_
#define USARTy                  USART1
#define USARTy_CLK              RCC_APB2_PERIPH_USART1
#define USARTy_GPIO             GPIOA
#define USARTy_GPIO_CLK         RCC_AHB_PERIPH_GPIOA
#define USARTy_RxPin            GPIO_PIN_10
#define USARTy_TxPin            GPIO_PIN_9
#define USARTy_RTSPin     	    GPIO_PIN_12
#define USARTy_CTSPin           GPIO_PIN_11 
#define USARTy_Rx_GPIO_AF       GPIO_AF5_USART1
#define USARTy_Tx_GPIO_AF       GPIO_AF5_USART1
#define USARTy_RTS_GPIO_AF      GPIO_AF5_USART1
#define USARTy_CTS_GPIO_AF      GPIO_AF5_USART1
#define USARTy_APBxClkCmd       RCC_APB2_Peripheral_Clock_Enable



#define USARTz                  USART2
#define USARTz_CLK              RCC_APB1_PERIPH_USART2
#define USARTz_GPIO             GPIOA
#define USARTz_GPIO_CLK         RCC_AHB_PERIPH_GPIOA
#define USARTz_RxPin            GPIO_PIN_3
#define USARTz_TxPin            GPIO_PIN_2
#define USARTz_RTSPin           GPIO_PIN_1
#define USARTz_CTSPin           GPIO_PIN_0
#define USARTz_Rx_GPIO_AF       GPIO_AF5_USART2
#define USARTz_Tx_GPIO_AF       GPIO_AF5_USART2
#define USARTz_RTS_GPIO_AF      GPIO_AF5_USART2
#define USARTz_CTS_GPIO_AF      GPIO_AF5_USART2
#define USARTz_APBxClkCmd       RCC_APB1_Peripheral_Clock_Enable


#endif

#ifdef _UART3_UART4_
#define USARTy                UART3
#define USARTy_GPIO           GPIOB
#define USARTy_CLK            RCC_APB2_PERIPH_UART3
#define USARTy_GPIO_CLK       RCC_AHB_PERIPH_GPIOB
#define USARTy_RxPin          GPIO_PIN_11
#define USARTy_TxPin          GPIO_PIN_10
#define USARTy_Rx_GPIO_AF     GPIO_AF10_UART3
#define USARTy_Tx_GPIO_AF     GPIO_AF10_UART3
#define USARTy_APBxClkCmd     RCC_APB2_Peripheral_Clock_Enable
#define USARTy_DAT_Base       (USART3_BASE + 0x04)
#define USARTy_Tx_DMA_Channel DMA_CH1
#define USARTy_Tx_DMA_FLAG    DMA_CH1_TXCF
#define USARTy_Rx_DMA_Channel DMA_CH2
#define USARTy_Rx_DMA_FLAG    DMA_CH2_TXCF
#define USARTy_Tx_DMA_REMAP   DMA_REMAP_USART3_TX
#define USARTy_Rx_DMA_REMAP   DMA_REMAP_USART3_RX

#define USARTz                UART4
#define USARTz_GPIO           GPIOB
#define USARTz_CLK            RCC_APB2_PERIPH_UART4
#define USARTz_GPIO_CLK       RCC_AHB_PERIPH_GPIOB
#define USARTz_RxPin          GPIO_PIN_1
#define USARTz_TxPin          GPIO_PIN_0
#define USARTz_Rx_GPIO_AF     GPIO_AF7_UART4
#define USARTz_Tx_GPIO_AF     GPIO_AF7_UART4
#define USARTz_APBxClkCmd     RCC_APB2_Peripheral_Clock_Enable
#define USARTz_DAT_Base       (UART4_BASE + 0x04)
#define USARTz_Tx_DMA_Channel DMA_CH5
#define USARTz_Tx_DMA_FLAG    DMA_CH5_TXCF
#define USARTz_Rx_DMA_Channel DMA_CH4
#define USARTz_Rx_DMA_FLAG    DMA_CH4_TXCF
#define USARTz_Tx_DMA_REMAP   DMA_REMAP_UART4_TX
#define USARTz_Rx_DMA_REMAP   DMA_REMAP_UART4_RX
#endif



typedef enum
{
    FAILED = 0,
    PASSED = !FAILED
} TestStatus;

void RCC_Configuration(void);
void GPIO_Configuration(void);
void DMA_Configuration(void);
TestStatus Buffercmp(uint8_t* pBuffer1, uint8_t* pBuffer2, uint16_t BufferLength);

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H__ */
